import math


def area(r):
    '''
    принимает радиус круга r, возвращает его площадь

    формула:
        π * r²

    параметры:  
        r (int/float): радиус круга

    возвращаемое значение: 
        float, площадь круга

    пример вызова:
        area(5) -> 78.53981633974483
    '''
    
    return math.pi * r * r


def perimeter(r):
    '''
    принимает радиус круга r, возвращает длину окружности

    формула:
        2 * π * r

    параметры:
        r (int/float): радиус круга

    возвращаемое значение:
        float, длина окружности

    пример вызова:
        perimeter(5) -> 31.41592653589793
    '''

    return 2 * math.pi * r
