def area(a):
    '''
    принимает сторону квадрата a, возвращает его площадь

    формула:
        a²
    
    параметры:
        a (int/float): длина стороны квадрата
    
    возвращаемое значение:
        int/float, площадь квадрата

    пример вызова:
        area(5) -> 25
    '''

    return a * a


def perimeter(a):
    '''
    принимает сторону квадрата a, возвращает его периметр

    формула:
        4 * a
    
    параметры:
        a (int/float): длина стороный квадрата

    возвращаемое значение:
        int/float, периметр квадрата

    пример вызова:
        perimeter(5) -> 20
    '''
    
    return 4 * a
