def area(a, h):
    '''
    принимает сторону треугольника a и высоту h, проведенную к стороне a,
    возвращает площадь треугольника

    формула:
        ½ * a * h
    
    параметры:
        a (int/float): длина стороны треугольника
        h (int/float): длина высоты, проведенной к стороне a
    
    возвращаемое значение:
        int/float, площадь треугольника

    пример вызова:
        area(5, 12) -> 30
    '''
    return a * h / 2 


def perimeter(a, b, c):
    '''
    принимает три стороны треугольника a, b, c, возвращает его периметр

    формула:
        a + b + c
    
    параметры:
        a (int/float): длина первой стороны треугольника 
        b (int/float): длина второй стороны треугольника
        c (int/float): длина третьей стороны треугольника
    
    возвращаемое значение:
        int/float, периметр треугольника

    пример вызова:
        area(3, 4, 5) -> 12
    '''
    return a + b + c 
